{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"4ae6b45a-5b33-5147-b44b-69393383ac1c","excerpt":"I’m trying to avoid writing a million “I listened to a CEO talk and learned this” articles, but sometimes you hear something that sticks with you and you just…","html":"<p>I’m trying to avoid writing a million “I listened to a CEO talk and learned this” articles, but sometimes you hear something that sticks with you and you just have to share it. When I heard this CEO speak earlier this week, she covered a lot of ideas some of which I was able to write down, others have just been coming back to me over the past few days. One of the ones that surfaced recently was something along the lines of owning and defining what your career story is. In her case, she realized early on most of her positions had been customer interfacing. So she totally owned it and branded herself as the customer expert in her company.</p>\n<p>This was really interesting to me as I have had a lot of trouble really telling the story of my own career, both as an internal dialog and on my resume. Our internal dialog is such a powerful force, yet so many people use it negatively. “I’m just a customer service representative.” Or “I only manage the projects.” Both of these can be reframed to show how you enable the customer to be successful. “I take care of any issues our customers have with the product.” Or “I work closely with customers to define their business problem and develop a solution to it.”</p>","frontmatter":{"title":"Own Your Career","date":"October 04, 2019","description":"After listening to a CEO talk earlier this week, one thing has continued to resonate with me. From an early point in her career, she made it a point to completely own what she was doing. She talked about becoming known for being the customer relationship expert and her ownership of this allowed her to clearly identify the value she brought to any position. How many times do we tell ourselves a negative story about what our job is?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/career-framing/","previous":{"fields":{"slug":"/bet-on-yourself/"},"frontmatter":{"title":"Be Willing to Bet on Yourself"}},"next":null}}