{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"b9e65f38-1e61-5f3c-94ff-eff64b75c55d","excerpt":"Second and third order effects. OODA loops. Observe, orient, decide, act. How we assess a situation and determine a course of action is critical to helping us…","html":"<p>Second and third order effects. OODA loops. Observe, orient, decide, act. How we assess a situation and determine a course of action is critical to helping us increase our ability to produce value. Being able to make believeable predictions about how those decisions will play out is, possibly, the most critical skill that people miss out on.</p>\n<p>When we transition from an individual contributor role into managing people or teams, a common mistake people run into is still only being focused on the immediate problem in front of them. Moving up into management requires expanding that scope of view to encompass what’s immediately here and what could be coming. Starting to think about cause and effect relationships is a crucial skill that often gets overlooked. As humans, our brains like to distort the view we have of previous decisions in order to protect us from feeling unhappy. In order to combat this, we should do a full review of any major decision we have made to see how well our predictions came true. Without measuring this, we cannot say with any accuracy how good a person is at predicting outcomes.</p>\n<p>So how do you start to identify possible outcomes and second order effects? A lot of times we have an ideal outcome we want to happen after our decision. “If we execute this project, then this outcome will happen.” So we already have one prediction, now we need to think about others. An easy place to start is to identify the opposite of our ideal outcome. “This project should move the business forward, but what if it doesn’t?” Where does failure of a project or initiative leave the business? Is it in a better position? Or a worse one? Starting to run thought experiments like this will start to open up other potential outcomes. “What if our result is slightly different from what we expect?” </p>\n<p>A great way to start doing this is by creating a decision journal. Farnam Street has a great article about decision journals <a href=\"https://fs.blog/2014/02/decision-journal/\">here</a> so I won’t go into the specifics of it. Essentially, you write down the situation, what you expect to happen and why and then how you feel about it. As you explore why you think a certain outcome will occur, you can start to identify any built in biases you may have about the situation and decision.</p>","frontmatter":{"title":"\"I never saw it coming!\"","date":"October 10, 2019","description":"How many times do we hear the phrase \"I never saw that coming\" in a situation where someone should have in fact, seen that coming? Why do the people we pay to see these things coming, so often miss it?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blindsided/","previous":{"fields":{"slug":"/finding-opportunities/"},"frontmatter":{"title":"Finding Leadership Opportunities"}},"next":null}}