{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"8a1665eb-caa6-520b-8042-d297e69d6421","excerpt":"Strategy: a high level plan to achieve one or more goals under conditions of uncertaintity. —WikipediaIn life, we often set goals for ourselves, or we build out…","html":"<h3>Strategy: a high level plan to achieve one or more goals under conditions of uncertaintity. —Wikipedia</h3>\n<p>In life, we often set goals for ourselves, or we build out a vision for how we want situations to play out. We tend to look towards the future and see ourselves in certain situations. But how do we get from where we are today, to those future situations? For most people, we just kind of hope that we will end up there. But there are people who actually sit down and look at ways to potentially reach those endpoints. This is the heart of strategy.</p>\n<h3>Dictionary definition of strategy: The science and art of using all the forces of a nation to execute approved plans as effectively as possible during peace or war.</h3>\n<p>A lot of people tend to relate strategy immediately to military strategy, which is where the word originated from. The Greek origins of strategy directly translate to the art of troop leader or general. But strategic thinking has proven useful beyond the battle field, as we can see with the increase in Strategic Planning teams within large business organizations. While these may seem like totally unrelated areas, both military and businesses must deal with limited resources, constantly changing landscapes and contending with outside entities that are actively trying to outmaneuver them.</p>\n<p>So, boiling all of these definitions down to a straight forward explanation: strategy is the overarching vision we have in place to get to “desirable ends with available means”. Strategy is not the individual steps we need to take to get to these ends, those are tactics. Strategy tends to focus more on the what than the how. Now that we have the basics of what strategy is, we can start exploring how to apply it in different life situations. Check back later this week for the next installment!</p>","frontmatter":{"title":"Alright, What Exactly is Strategic Thinking?","date":"August 18, 2019","description":"Okay, Jordan, you announced you are going to focus your content on strategy and strategic thinking. Awesome. But what exactly is strategy? How do you turn that into strategic thinking? What does all of this mean to us?!"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/what-is-strategy/","previous":{"fields":{"slug":"/strategy-project/"},"frontmatter":{"title":"Strategy Project"}},"next":null}}