{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"7a2890c7-0578-57fd-90a5-ab8dba1ec1aa","excerpt":"How do we build more authentic connections to people?As a leader/manager in an organization, it is crucial to create highly effective teams. When a team…","html":"<h3>How do we build more authentic connections to people?</h3>\n<p>As a leader/manager in an organization, it is crucial to create highly effective teams. When a team coalesces around a central vision, they can magnify the effectiveness of the individual contributors. But how do leaders create this buy in? Shouldn’t people give everything they can because we are giving them a paycheck? </p>\n<h3>Relationships based on authentic connections are key.</h3>\n<p>Recently I was talking with a friend of mine about meeting people, in particular, this conversation was focused on dating and talking to people in bars. They were expressing frustation with people bailing on plans and ghosting on conversations in person. One of the things I had noticed about this persons approach was, it came off very transactional in nature. Their approach raised feelings of “I’m doing this for you, you owe me something in return,” which really puts a lot of unneccessary pressure on situations.</p>\n<p>When you’re out meeting people and talking to them, it’s key to focus on creating meaningful interactions with people. A lot of words have been written about changing relationships from feeling transactional to more of a mutual beneficial situation. </p>","frontmatter":{"title":"Building Authentic Connections","date":"September 21, 2019","description":"I was recently reminded that life revolves around the relationships we build with people. In work, it's easy to just say \"I am paying this person to do this function, so they need to do it.\" Yes, that can have results, but with that transactional nature you won't get anything more from that person."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/authentic-connections/","previous":{"fields":{"slug":"/career-strategy/"},"frontmatter":{"title":"Be Strategic in Your Career Choices"}},"next":null}}