{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"cb4140b5-d178-5b56-b22f-7d5fcd57a07b","excerpt":"I am vehemently anti-meetings. Early on in my career I had seen my fair share of terrible meetings that should have been an email. Or ones intended to provide…","html":"<p>I am vehemently anti-meetings. Early on in my career I had seen my fair share of terrible meetings that should have been an email. Or ones intended to provide quick project updates that quickly devolved into someone venting about their projects. This experience shaped my disdain for meetings and I promised myself I would never host meetings like these when I was in charge. Fast-forward to when I finally was in charge of my own teams. For the first year, I didn’t hold a central staff meeting. I had each team lead attend the weekly Operations meeting to get the important information, which they could then pass down to their teams. This worked for a bit, but eventually I needed to get consistent flow of information back from each team. Trying to catch the leads and get updates on the fly was no longer working.</p>\n<p>So eventually I gave in and started having a weekly staff meeting, where the team leads would provide me with updates, I would pass down any important directions and we would hash out any issues that teams were having. I was still kind of anti-meeting though, so even these meetings were not as effective as they could be. I focused too much on minimizing the disruption to peoples days and tended to run through the meetings too quickly.</p>\n<h5>Wouldn’t it be great if we could have productive meetings that don’t suck?</h5>\n<p>With my utter contempt for meetings, I was intrigued when I ran across a book recently, <em>The Art of Gathering</em>, by Priya Parker. She promiesd to transform terrible meetings into wondrous occasions for celebration. Okay not quite that far, but she did mention making them suck just a little bit less. So I was hooked. </p>\n<p>She covers a lot of ground in the book and I’m not going to give you the cliff’s notes here, but the key takeaway I had is that meetings tend to suck because nobody takes ownership of them. Nobody takes the necessary time to sit down and create a meeting with intent and purpose. We hold a weekly staff meeting to get everyone in the same room. The manager doesn’t have anything to discuss. The team members don’t want to bring up any of their concerns in front of a crowd. Somehow, we end up filling the allotted time anyway.</p>\n<p>After I read this book, I have a few action items I need to implement. While I am not in a position of calling meetings anymore, I do get invited to meetings. For these meetings, I plan on ensuring I walk in prepared to discuss whatever the topic is. For those of you who do set up meetings, I would highly recommend picking up a copy of the book and taking some notes.</p>","frontmatter":{"title":"Gathering Effectively","date":"September 30, 2019","description":"How many organizations waste time with pointless meetings? Why don't we fight back against them, not by killing the meeting, but by taking more ownership of them?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/effective-gathering/","previous":{"fields":{"slug":"/blindsided/"},"frontmatter":{"title":"\"I never saw it coming!\""}},"next":{"fields":{"slug":"/risky-business/"},"frontmatter":{"title":"Let's Talk About Risk, Baby"}}}}