{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"b624d813-f47f-5b1c-bfb5-fe6f196a7ca7","excerpt":"I often find myself wanting to write. I’ll be at home, at work or out and about and thing to myself “I really want to just sit down and write for a bit.” But…","html":"<p>I often find myself wanting to write. I’ll be at home, at work or out and about and thing to myself “I really want to just sit down and write for a bit.” But then I find all sorts of little things to do to avoid writing. Checking Instagram or Twitter. Messing with my LinkedIn profile. Washing the dishes (weird I know). Literally anything to keep from sitting down in front of the computer to actually write something.</p>\n<p>Some times, I do get writers block. So I honestly can’t think of the words I want to say when I sit down. This happens to everyone and is completely normal. Usually though, if I force myself to sit there I will start throwing out random thoughts and eventually coalesce into some semi-coherent rambling. This is, from what I hear, the normal writing process for a lot of people. But in these cases, I forced myself to show up and do the work.</p>\n<p>How many of us do similar things with other parts of our lives? Wanting a relationship, wanting to get fit, wanting to eat better. We do everything else, saying eventually we’ll get to that hard thing we really want to do.</p>\n<p>I recently got myself back in the gym and on a regular workout program, which got me thinking about this topic. I didn’t make any excuses for not going to the gym, but once I got back in, I kept wanting to quit the workout halfway through. But that wouldn’t have given me any progress or satisfaction. So I did the work and I am seeing the results.</p>\n<p>This experience reminded me of what I have long known, but tend to forget. We just need to do the work. Instead of putting it off or making excuses or trying to hack our way around the work, just do it. Suck up the short term pain and get it over with. The payoff is always worth the work you have to do.</p>","frontmatter":{"title":"Just Do The Work","date":"August 10, 2019","description":"How often do we find ourselves putting off things we don't want to do? We'll spend hours, days even, avoiding things until we absolutely can't avoid it any longer. And then we do it. And it's not nearly as bad as we thought. We would all be better off just doing the work."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/do-the-work/","previous":{"fields":{"slug":"/renting-out-your-time/"},"frontmatter":{"title":"You Won't Get Rich Renting Out Your Time -- My Thoughts"}},"next":null}}