{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Strategy: a high level plan to achieve one or more goals under conditions of uncertaintity. —WikipediaIn life, we often set goals for…","fields":{"slug":"/what-is-strategy/"},"frontmatter":{"date":"August 18, 2019","title":"Alright, What Exactly is Strategic Thinking?","description":"Okay, Jordan, you announced you are going to focus your content on strategy and strategic thinking. Awesome. But what exactly is strategy? How do you turn that into strategic thinking? What does all of this mean to us?!"}}},{"node":{"excerpt":"","fields":{"slug":"/identify-the-problem/"},"frontmatter":{"date":"August 18, 2019","title":"Step One: Identify the Problem","description":"Okay, Jordan, you announced you are going to focus your content on strategy and strategic thinking. Awesome. But what exactly is strategy? How do you turn that into strategic thinking? What does all of this mean to us?!"}}},{"node":{"excerpt":"For anyone who has been following me, you have seen the series I was doing on Naval Ravikants tweetstorm on how to create wealth. I got up…","fields":{"slug":"/strategy-project/"},"frontmatter":{"date":"August 17, 2019","title":"Strategy Project","description":"After flitting from topic to topic without any discernible direction, I have decided to focus my writing on strategy and strategic thinking/planning. It is a topic that has been important in my career and I think more people would benefit from learning about it."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/give-society-what-it-wants/"},"frontmatter":{"date":"August 13, 2019","title":"Give Society What It Doesn't Know How To Get -- My Thoughts","description":"When working to create wealth for ourselves and society, we need to seek out what unique product we can provide and then figure out how to scale it."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/live-below-your-means/"},"frontmatter":{"date":"August 11, 2019","title":"Live Below Your Means -- My Thoughts","description":"Living below your means grants you a certain freedom that people who live at or above their means never experience. When we live below our means, we are less likely to fall into the wage slave trap that afflicts a lot of society. We can pick and choose what we give our time and energy to."}}},{"node":{"excerpt":"I often find myself wanting to write. I’ll be at home, at work or out and about and thing to myself “I really want to just sit down and…","fields":{"slug":"/do-the-work/"},"frontmatter":{"date":"August 10, 2019","title":"Just Do The Work","description":"How often do we find ourselves putting off things we don't want to do? We'll spend hours, days even, avoiding things until we absolutely can't avoid it any longer. And then we do it. And it's not nearly as bad as we thought. We would all be better off just doing the work."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/renting-out-your-time/"},"frontmatter":{"date":"August 08, 2019","title":"You Won't Get Rich Renting Out Your Time -- My Thoughts","description":"Holidng a regular 9-5 job is essentially renting out your time. Someone offers you some money to show up at a certain place and you do it. When you rent out your time, you limit your output based on your input. You will never generate true wealth until your outputs can non-linearly scale from your inputs. Creating new products or businesses is the only way to generate non-linear outputs."}}},{"node":{"excerpt":"How do we make better decisions? What are the biggest hindrances people face when trying to make decisions? In regular life as well as…","fields":{"slug":"/radical-open-mind/"},"frontmatter":{"date":"August 06, 2019","title":"Making Better Decisions with a Radically Open Mind","description":"When we make decisions in life, we want to believe we are basing these decisions on things that are true. Any analysis we may run is worthless if the underlying information is flawed. One way to really assess the validity of our underlying information is through radical open mindedness."}}},{"node":{"excerpt":"Howdy, y’all!So, June and July have been some hectic months. I moved to Texas, started a new job and have been slowly getting settled in and…","fields":{"slug":"/currently-reading/"},"frontmatter":{"date":"July 30, 2019","title":"A Brief Catch Up & Currently Reading","description":"After a short hiatus, I figured it was time to provide a brief update as to what has been going on in life and provide a brief list of some of the best things I've been reading lately."}}},{"node":{"excerpt":"This conversation discusses the concept and role of luck required to become wealthy. There is a common misconception that wealthy people…","fields":{"slug":"/making-money-isnt-luck/"},"frontmatter":{"date":"June 20, 2019","title":"Making Money isn't About Luck -- My Thoughts","description":"There is a common misconception that rich people got \"lucky\" at some point in their life. But really, most wealthy people got there by being the type of person that makes money."}}},{"node":{"excerpt":"This entry covers the converstaion around free markets and how they are intrinsic to humans. One of the things I have found to be incredible…","fields":{"slug":"/free-markets-are-intrinsic/"},"frontmatter":{"date":"June 18, 2019","title":"Free Markets are Intrinsic to Humans -- My Thoughts","description":"Human beings by nature keep track of credits and debits in all aspects of life. This is an inherent part of being human and works the same way as free markets do in economics."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/create-abundance/"},"frontmatter":{"date":"June 16, 2019","title":"Make Abundance for the World - My Thoughts","description":"Do not confuse creating wealth with stealing from other people."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/seek-wealth/"},"frontmatter":{"date":"June 15, 2019","title":"Seek Wealth, Not Money or Status - My Thoughts","description":"Confusing money and status with wealth gives people the wrong incentives in their life."}}},{"node":{"excerpt":"So, I haven’t posted anything for a few weeks. As I have mentioned in other places I recently left a job to start a new career as a software…","fields":{"slug":"/life-update/"},"frontmatter":{"date":"June 14, 2019","title":"Big Changes in Life","description":"Things have been quiet here for the past few weeks, because I was in the process of moving!"}}},{"node":{"excerpt":"Problem StatementGiven a string containing just the characters ’(’, ’)’, ’{’,’}’, ’’, ’’, determine if the input string is valid. An input…","fields":{"slug":"/daily-algorithm-31-may/"},"frontmatter":{"date":"May 31, 2019","title":"Daily Algorithm Practice - Valid Parentheses","description":"Todays algorithm practice problem looks at using a stack to check whether a passed in string contains a closing parenthesis for each opening parenthesis."}}},{"node":{"excerpt":"Problem StatementRemove all elements from a linked list of integers that have value val.Example:Input = 1 -> 2 -> 6 -> 3 -> 4 -> 5 -> 6val…","fields":{"slug":"/daily-algorithm-30-may/"},"frontmatter":{"date":"May 30, 2019","title":"Daily Algorithm Practice - Remove Elements From a Linked List","description":"Todays algorithm looks at how we can remove a specific value from a linked list, if it is present."}}},{"node":{"excerpt":"Problem StatementMerge two sorted linked lists and return it as a new list. The new list should be made by splicing together the nodes of…","fields":{"slug":"/daily-algorithm-29-may/"},"frontmatter":{"date":"May 29, 2019","title":"Daily Algorithm Practice - Merge Sorted Linked Lists","description":"Todays algorithm practice focuses on merging two sorted linked lists into one."}}},{"node":{"excerpt":"59 Percent of Americans consider themselves savers, yet only 38 percent have an emergency fund.I was reading through the Schwab 2019 Modern…","fields":{"slug":"/saving-mentality/"},"frontmatter":{"date":"May 28, 2019","title":"Can We Build a Mentality of Saving in a World Constantly Pushing us to Spend?","description":"Focusing on the areas of life that bring us most joy and then applying our money to that area is a powerful tool to fight against FOMO we may experience from social media."}}},{"node":{"excerpt":"Problem StatementGiven two sorted number arrays, nums1 and nums2, merge nums2 into nums1 as one sorted array.We are given m and n which…","fields":{"slug":"/daily-algorithm-24-may/"},"frontmatter":{"date":"May 24, 2019","title":"Daily Algorithm Practice - Merge Sorted Lists","description":"Todays algorithm practice focuses on merging two sorted lists into one in constant space."}}},{"node":{"excerpt":"After playing around with Gatsby.js to rebuild my web presence, I started looking more into the JAMstack idea/community and I realized I…","fields":{"slug":"/react-conversion-part-one/"},"frontmatter":{"date":"May 24, 2019","title":"Building a React Based Portfolio Index Site","description":"The first part of this series focuses on building a header component that can be reused across an application."}}},{"node":{"excerpt":"Problem Statement:Consider all the leaves of a binary tree. From left to right order, the values of those leaves form a leaf value sequence…","fields":{"slug":"/daily-algorithm-practice-23-may/"},"frontmatter":{"date":"May 23, 2019","title":"Daily Algorithm Work May 23, 2019","description":"Daily practice on algorithms"}}},{"node":{"excerpt":"As I was sitting in a hip taco spot in downtown Boise this past weekend, I started reflecting on what this city means to me. Growing up, I…","fields":{"slug":"/missing-places/"},"frontmatter":{"date":"May 22, 2019","title":"Missing Places","description":"Our minds ascribe a certain feeling to places we have in our memory, which influences how we view that places when reflecting on it."}}},{"node":{"excerpt":"Allow me to reintroduce myself…Since I’ve revamped my site, I figured it would be a good idea to provide a bit more detail on who I am and…","fields":{"slug":"/about-me-post/"},"frontmatter":{"date":"May 21, 2019","title":"Who is Jordan Ristow?","description":"Brief background about the author"}}},{"node":{"excerpt":"Using Gatsby.js is Easy and PowerfulSo, after running through most of the tutorial on gatsby, I wanted to do a quick write up on my overall…","fields":{"slug":"/second-post/"},"frontmatter":{"date":"May 20, 2019","title":"First Reaction to Using Gatsby.js","description":"Gatsby.js provides a great developer experience while allowing you to build powerful static websites."}}},{"node":{"excerpt":"We’re BAAAAAACK!!!!Well, I spent most of this weekend messing around with gatsby.js to build up this new blog/website. I finally got most of…","fields":{"slug":"/first-post/"},"frontmatter":{"date":"May 19, 2019","title":"New Website/Blog","description":"This is the first post on my newly revamped website/blog presence."}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}