{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"eda2281b-05df-5f52-b15d-4cbac6ac337a","excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a series of podcasts…","html":"<br>\n<p><em>Earlier this year <a href=\"https://twitter.com/naval\">@naval</a> posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a series of podcasts expounding on each individual tweet (view it <a href=\"https://nav.al/category/wealth/\">here</a>). Each of these posts provided a more in depth look at what he meant. In this series of posts I will summarize what each podcast covers and write out some actionable take aways I plan on implementing from that particular conversation.</em></p>\n<p>This first discussion is focused on differentiating between wealth, money and status. Often people tend to mix these three up and view them as interchangable. Obviously someone who attends high status social events will be wealthy and have a lot of money. Instead of just applying that blanket thought to all three, we should actually look at what each one really is. Naval provides a great definition for each of these:</p>\n<ul>\n<li><strong>Wealth is assets that earn while you sleep.</strong></li>\n<li><strong>Money is how we transfer wealth.</strong></li>\n<li><strong>Status is your rank in the social hierarchy.</strong></li>\n</ul>\n<p>The conversation around these concepts is very good and I would encourage you to listen to the full recording, it’s only six minutes long. But today I want to just highlight a few take aways I had and then provide a few ways I plan on putting these concepts into practice.</p>\n<h3>Key Takeaways</h3>\n<p>For me, the first of these was probably the one that took me longest to learn. Growing up, I was never exposed to this idea of building and growing wealth so my belief was that you had to increase your salary if you wanted to earn more money. I did not understand how investments could increase in value while I slept or dividends would be paid out without any active work from me. It wasn’t until after I got my first job out of university that I started reading and learning about pursuing financial freedom, which lead me to learn about investing and owning pieces of companies.</p>\n<p>Money as a means of transferring wealth, that to me makes sense. If we look at a persons salary, for example, we can frame that as being the transfer of a portion of the value that person created for a business back to that person. The main difference being that this transfer of wealth is based upon spending your time to increase the value of this business. Which is a key differentiator between wealth and money. Wealth increases in value without your direct labor while increasing your money will require effort from you.</p>\n<p>While his converstaion on status focuses on people’s use of it as a virtue signal, I would actually frame it in a manner of people trying to signal their wealth. Picture the guy who drives the Ferari or Porsche everywhere he goes. Most people think about how expensive that vehicle is and how much it must cost to drive and this leads them to believe this signals higher status/wealth.\nOn status, the key differentiator is the hierarchical nature of status, which pushes it into a zero-sum game. We cannot increase our status without someone else losing theirs. Wealth, conversely, is not a zero-sum game. We can increase our wealth without someone else losing part of theirs. In my mind, people tend to view status too strongly as an indicator of wealth. </p>\n<h3>Actionable Takeaways</h3>\n<p>For me, I think this tweet is useful to help shift our focus from earning a high salary, or getting caught up in status games, to instead focus on adding to our portfolio. Whether that is through investing more money into stocks or building additional revenue streams from creating businesses, we will be better off in the long run. Further, if we are less focused on status games, I think our desire/drive to buy new physical manifestations of our “wealth.”</p>","frontmatter":{"title":"Seek Wealth, Not Money or Status - My Thoughts","date":null,"description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/seek-wealth/","previous":{"fields":{"slug":"/daily-algorithm-31-may/"},"frontmatter":{"title":"Daily Algorithm Practice - Valid Parentheses"}},"next":null}}