{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"fe80c056-9c77-5b71-a444-e46ee623f186","excerpt":"59 Percent of Americans consider themselves savers, yet only 38 percent have an emergency fund.I was reading through the Schwab 2019 Modern Wealth Survey…","html":"<h2>59 Percent of Americans consider themselves savers, yet only 38 percent have an emergency fund.</h2>\n<p>I was reading through the Schwab 2019 Modern Wealth Survey recently and I saw the above highlights, which really blew my mind. How can we claim 59 percent of the population are savers, but less than 40 percent can cover an emergency?</p>\n<p>Don’t get me wrong, I can understand people who classify themselves as savers but find themselves without anything extra in the bank at the end of the month. I was in that boat for a long time too. I always planned on putting money into my savings, some months actually putting the money in the account, but then a bill would come up that required me pulling that money out and spending it. In my case, I had built up an unsustainable level of monthly expenses, through housing costs, car loans and credit card debt, that I didn’t have enough money coming in each month to allow me to put money away.</p>\n<p>After getting my car loans and credit card debt sorted out, one of the things that helped me cut back on extraneous spending which allowed me to start building up a savings cushion was this mindset shift, focusing my spending on things that I deeply valued. I realized I had been spending money on so many random things; new clothes, nights out at the bar, various electronic trinkets but none of these items were truly things that I valued and brought a lot of joy to my life. So I sat down and spent some time identifying the areas of my life that brought out the most joy for me. Kind of applying Marie Kondo’s “spark joy” thought process to my finances.</p>\n<p>Once I identified the top three areas of life that sparked joy in me, I sat down and started allocating money into these areas. Every month I have a note in my phone with my major spending areas and the total amount I can spend in that area for the month. As I make purchases, I subtract that amount from the overall balance for that category and make sure I stay above zero there.\n\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/e6b3f45c09bdae9582de64e1a3786f77/44dfd/budgetNote.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 117.71336553945251%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAYABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEF/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEAMQAAAB3UoBKAH/xAAUEAEAAAAAAAAAAAAAAAAAAAAw/9oACAEBAAEFAh//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/AR//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/AR//xAAUEAEAAAAAAAAAAAAAAAAAAAAw/9oACAEBAAY/Ah//xAAbEAACAQUAAAAAAAAAAAAAAAAQEQABITFh4f/aAAgBAQABPyFBLEeqlX6f/9oADAMBAAIAAwAAABAgwDz/xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/EB//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/EB//xAAbEAEAAgMBAQAAAAAAAAAAAAABESEAEFFB0f/aAAgBAQABPxAAr66BKATdYw+GFnNWsMdwEEGv/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"simple budget screenshot\"\n        title=\"\"\n        src=\"/static/e6b3f45c09bdae9582de64e1a3786f77/c739e/budgetNote.jpg\"\n        srcset=\"/static/e6b3f45c09bdae9582de64e1a3786f77/8ee9c/budgetNote.jpg 148w,\n/static/e6b3f45c09bdae9582de64e1a3786f77/ebbe7/budgetNote.jpg 295w,\n/static/e6b3f45c09bdae9582de64e1a3786f77/c739e/budgetNote.jpg 590w,\n/static/e6b3f45c09bdae9582de64e1a3786f77/5413e/budgetNote.jpg 885w,\n/static/e6b3f45c09bdae9582de64e1a3786f77/4efde/budgetNote.jpg 1180w,\n/static/e6b3f45c09bdae9582de64e1a3786f77/44dfd/budgetNote.jpg 1242w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<center>clearly I spend a lot of money on food and coffee...</center>\n<p>Now, this money is separate from what I need to pay my monthly bills and I also consider saving as a “bill” that I have to pay every month. Doing this for every category of spending you have each month would be helpful as a first step towards wrangling your spending habits.</p>\n<h3>How does this help?</h3>\n<p>In the report from Schwab, a third of Americans claim negative influence from social media as causing them to overspend. Amongst millennials and Gen z members, that amount jumps to almost half. But if we have a framework of spending money on the things that bring us the most joy and have identified what those areas are, we can remind ourselves as we scroll through Instagram that all these pictures from our friends don’t necessarily align with our areas of joy. If we don’t value </p>","frontmatter":{"title":"Can We Build a Mentality of Saving in a World Constantly Pushing us to Spend?","date":"May 28, 2019","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/saving-mentality/","previous":{"fields":{"slug":"/daily-algorithm-24-may/"},"frontmatter":{"title":"Daily Algorithm Practice - Merge Sorted Lists"}},"next":null}}