{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"20f81159-aede-5051-b21a-a5c14239903b","excerpt":"So recently I was having a conversation with someone about work and career progression and they made a comment that got me thinking. They said “You don’t need…","html":"<p>So recently I was having a conversation with someone about work and career progression and they made a comment that got me thinking. They said <em>“You don’t need to worry about your career, you just need to worry about finding the next position. Your career will develop later.”</em></p>\n<p>For some context, my current role isn’t permanently assigned to a single team, and they were referring to me landing a permanent spot on a team. But zooming out a little, there are a few things we can explore with this statement. </p>\n<p>First, the initial positions we take in our careers can drastically shape what future positions are available to us. In software engineering, if you start out focused solely on frontend work it can be difficult to transition into a backend position after that. Or if you go into a specialized role like DevOps, you may be pigeonholed the rest of your career.</p>\n<p>Second, focusing solely on landing that next position without considering what our ultimate career goals are, is short sighted. If we want to become a CTO, it doesn’t make sense to work on becoming the most technically smart engineer. We need to branch out into managing teams and learning how to shape and steer the strategy of our company. Conversely, if we want to move into a lead technical role, architecting the systems and deployment strategies it doesn’t make sense to get into management positions.</p>\n<p>Not everyone is going to know what they want to end up as in their career and thats okay. Some people are totally happy just moving from one job to another without worrying about achieving some end goal. But a lot of people are unhappy with their jobs and often it boils down to them not doing what they feel like they want to do.</p>","frontmatter":{"title":"Be Strategic in Your Career Choices","date":"August 23, 2019","description":"As we progress in our careers, it is important to have an understanding of how each new job takes us closer, or farther, from our career goals. It's easy to just float along without thinking about where we are  headed. But this can lead us into positions that we are unhappy with or ones that don't align with our inner strengths."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/career-strategy/","previous":{"fields":{"slug":"/identify-the-problem/"},"frontmatter":{"title":"Step One: Diagnosis"}},"next":null}}