{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"b1da0a5c-0c36-51d3-aece-458efe68b77e","excerpt":"Random Thoughts on SuccessAfter this past week, I’ve been reflecting a little on what has driven my previous success. One of the key themes I keep noticing and…","html":"<h3>Random Thoughts on Success</h3>\n<p>After this past week, I’ve been reflecting a little on what has driven my previous success. One of the key themes I keep noticing and coming back to is the relationship factor. Anytime I have been able to create great wins for the organization I was working for, I had to leverage skillsets from a lot of different people. This is typical in the modern business world, who isn’t a part of at least one work team?</p>\n<p>But the difference, from my experience, has been the nature of the relationships I had with the members of that team. From my first days as a project engineer, I was exposed to team leaders who tried to force their will on different members of the team. This was not the most effective strategy. The biggest thing I learned from these early days, we need to build relationships based on mutual respect to drive effectiveness.</p>\n<p>When I was a more seasoned project manager, I had colleagues with several more years of experience coming to me to ask my advice on how to move projects forward. The advice I gave them was simple, know your job and don’t tell someone else how to do their job. Ask “how do we make this happen” instead of demanding something be done. When you approach a person on a human level, respecting the fact that they probably know more than you do about that job function, they will move mountains to help you.</p>\n<p>It amazes me, to this day, how many people don’t understand this concept.</p>","frontmatter":{"title":"Driving Success","date":"September 29, 2019","description":"Reflecting on my past successes, I have noticed a strong common theme. None of these successes or awards were earned from my own efforts, in every endeavor I have been successful there has been a strong team, built with strong relationships."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/drive-success/","previous":{"fields":{"slug":"/effective-teams/"},"frontmatter":{"title":"Building Effective Teams"}},"next":null}}