{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"781a3f46-3be6-595d-b034-db83500ed2c4","excerpt":"I’ve been using the words leader and manager almost interchangeably in my posts and in a lot of situations the people we look to for leadership are those in…","html":"<p>I’ve been using the words leader and manager almost interchangeably in my posts and in a lot of situations the people we look to for leadership are those in positions of management. But leaders don’t always have to be managers. I wrote a post recently about ways you can show you are ready to move into a managerial position and it was mostly focused on showing off your ability to be a leader. How can we differentiate these two? Are there really any distinctions between leaders and managers?</p>\n<p>We’ve already presented that not all leaders have to be managers. You can be a leader simply by helping to guide and coach the people around you. Taking new members of your team and helping bring them up to speed without being told to so is an example. It really boils down to taking initiative when you see something that needs to get done. This is at the heart of leadership. </p>\n<p>While leadership is a somewhat esoteric concept, one of those “I’ll know it when I see it” things, management has a pretty widely accepted definition. Management is the administration of an organization. Simple as that. The day to day tasks that must happen in order for an organization to run. Yes, setting a strategy and identifying goals are included as well. But at it’s heart, management is all about how an organization allocates the resources at it’s disposal.</p>\n<p>That sounds pretty cold, right? It doesn’t have to be. This is why I talk so much about building relationships with people. When you build real connections with people, it becomes easier to lead them. It also becomes easier to deliver bad news, like when a deadline gets pulled forward and now the team has to put in extra hours. Having a deeper relationship, as a leader, gives you the buy in from those following you.</p>","frontmatter":{"title":"Leader vs. Manager","date":"October 16, 2019","description":"We often hear the words manager and leader used interchangeably. But do they really reflect the same things? Is someone who is a good manager, also a good leader? Just because someone is great as a leader, does that mean they'll be great as a manager?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/leader-vs-manager/","previous":{"fields":{"slug":"/career-planning/"},"frontmatter":{"title":"Career Planning"}},"next":null}}