{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"cd06e08e-d477-5256-b679-3b9b223cbbbc","excerpt":"This conversation discusses the concept and role of luck required to become wealthy. There is a common misconception that wealthy people somehow lucked into…","html":"<br>\n*Earlier this year [@naval](https://twitter.com/naval) posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a series of podcasts expounding on each individual tweet (view it [here](https://nav.al/how-to-get-rich#more-28492840)). Each of these posts provided a more in depth look at what he meant. In this series of posts I will summarize what each podcast covers and write out some actionable take aways I plan on implementing from that particular conversation.*\n<p>This conversation discusses the concept and role of luck required to become wealthy. There is a common misconception that wealthy people somehow lucked into their wealth, when really a majority of wealthy people got there by working really hard at some craft. Building something that created value for the rest of society.</p>\n<p>Naval highlights four types of luck that play different roles in how people can create wealth. The first, blind luck, is what people traditionally credit with making others wealthy. This is the lottery winner, some external event happens that I have no control over that makes me wealthy. Second, we have luck from hustling, where we are always moving, creating opportunities until the right opportunity hits. Third is luck from preparation, which is tied to being skilled in a field and being able to notice when a lucky break happens in that field. Finally there is luck from your unique character, which is weird. It is based on you building a unique character, brand or mindset where then luck finds you. I think the best way to summarize this one is this line “You created your own luck.”</p>\n<h3>Key Takeaways</h3>\n<p><strong>We cannot hope that luck will make us wealthy.</strong></p>\n<p><strong>We can build a skillset/product where we are in demand, which is a special type of luck.</strong></p>\n<p><strong>Wealth stacks up one chip at a time.</strong></p>\n<h3>Action Items</h3>\n<p>From this one, my main action item is to continue reading and working on my critical thinking and decision making skills. Along with my software engineering knowledge, eventually this will put me in position to do some incredible work.</p>","frontmatter":{"title":"Making Money isn't About Luck -- My Thoughts","date":"June 20, 2019","description":"There is a common misconception that rich people got \"lucky\" at some point in their life. But really, most wealthy people got there by being the type of person that makes money."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/making-money-isnt-luck/","previous":{"fields":{"slug":"/free-markets-are-intrinsic/"},"frontmatter":{"title":"Free Markets are Intrinsic to Humans -- My Thoughts"}},"next":{"fields":{"slug":"/currently-reading/"},"frontmatter":{"title":"A Brief Catch Up & Currently Reading"}}}}