{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"915471d1-8824-535d-b326-50912a2ccd49","excerpt":"Organizations are increasingly more concerned with the effectiveness of their workforces. With increased distractions from e-mail, social media, phone calls…","html":"<p>Organizations are increasingly more concerned with the effectiveness of their workforces. With increased distractions from e-mail, social media, phone calls, slack and other pop up requirements, there is more scrutiny being placed on how much work employees are actually accomplishing during their work days. Having an understanding what the important things to focus on is vital for everyone in an organization. How can we know if we are working on the most important things?</p>\n<h3>Effectiveness: doing the right things</h3>\n<p>It’s easy to highlight the “wrong” things to focus on, people have done it all before. Email, slack, texts, social media are all low hanging fruit we should minimize our attention on. However, when it comes to actual work, what is the right thing to focus on? How do we weight all of those tasks we have to take care of? This is where it is vital for organizations to look at expected outcomes for any project or initiative. If you aren’t prioritizing the expected outcomes by impact to the business, it becomes very difficult to identify why one task should be prioritized over another.</p>\n<h3>Efficiency: doing things right</h3>\n<p>Efficiency is an easier goal to track. We all spend roughly 8 hours a day at work, how much of that time is spent directly on tasks that move projects or initiatives forward? A “good” answer will depend a lot on your particular role. More reactive roles, where you are waiting for some event to happen before you respond, may have very low direct hours on some days. Knowledge workers may have to spend time researching a topic before they are able to actually take care of a particular task. If you know how to accomplish a task and are simply procrastinating doing it, you are not being efficient.</p>\n<h3>Measuring outcomes</h3>\n<p>Every organization has a mission statement and some strategic goals. If you don’t know what your orgainzations are, go look them up, ask a manager or coworker what they are. You should keep these in mind and frame the work you do every day within the context of those goals. Look at each of the projects or initiatives you have and see which ones directly align with those goals. Try to identify which outcomes will move the needle the most against any of those strategic goals. Whichever one does that, is where your focus and time should be going.</p>\n<p>It is easy to serve platitudes to being effective or efficient in our work. These are becoming buzzwords within business and everyone has their hacks they want to sell you to help make you more effective and efficient. But by simply focusing on those outcomes that drive progress against an organizations strategic goals, you will be more effective.</p>","frontmatter":{"title":"Effectiveness, Efficiency and Measuring Outcomes","date":"October 08, 2019","description":"I recently saw a talk where the speaker discussed the differences between effectiveness and efficiency. They gave a definition that I liked, effectiveness is doing the right things while efficiency is doing things right."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/measuring-outcomes/","previous":{"fields":{"slug":"/why-leadership/"},"frontmatter":{"title":"Finding Our Purpose"}},"next":{"fields":{"slug":"/finding-opportunities/"},"frontmatter":{"title":"Finding Leadership Opportunities"}}}}