{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"7a2890c7-0578-57fd-90a5-ab8dba1ec1aa","excerpt":"How do we build more effective teams in an organization?As a leader/manager in an organization, it is crucial to create highly effective teams. When a team…","html":"<h3>How do we build more effective teams in an organization?</h3>\n<p>As a leader/manager in an organization, it is crucial to create highly effective teams. When a team coalesces around a central vision, they can magnify the effectiveness of the individual contributors. But how do leaders create this buy in? Shouldn’t people give everything they can because we are giving them a paycheck? </p>\n<h3>Relationships based on authentic connections are key.</h3>\n<p>When your team’s only motivation is a paycheck, you create a transactional relationship, where they are only as invested as they need to be to get their payoff. If you instead focus on building a relationship based on mutual respect, that person is more willing to go the extra mile for you. When each member of your team is willing to go above and beyond, that is when you create the most value.</p>\n<h3>Create a bold vision, then create buy in.</h3>\n<p>Defining a bold guiding vision for your team is an often over looked step in building high functioning teams. If you, as the manager, can define the direction you are going and then build excitement around that vision, it makes the team feel more connected to their work. Without some guiding vision, a team will wander aimlessly.</p>\n<p>It’s easy for managers to get bogged down in the day to day drudgery of keeping a system moving. Meetings, phone calls, interviews all suck time and energy away from what their core focus should be. But it is crucial to take time to define the overall vision for a team and build consensus around that. If a manager fails to do this, they are losing out.</p>","frontmatter":{"title":"Building Effective Teams","date":"September 28, 2019","description":"I was recently reminded that life revolves around the relationships we build with people. In work, it's easy to just say \"I am paying this person to do this function, so they need to do it.\" Yes, that can have results, but with that transactional nature you won't get anything more from that person."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/authentic-connections/","previous":{"fields":{"slug":"/career-strategy/"},"frontmatter":{"title":"Be Strategic in Your Career Choices"}},"next":null}}