{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"b3410f6e-b07f-55e3-9b8c-dc30b165ee51","excerpt":"Good strategy is built on an underlying structure that anyone can use in their own life. We can generalize three distinct phases in strategic thinking and then…","html":"<p>Good strategy is built on an underlying structure that anyone can use in their own life. We can generalize three distinct phases in strategic thinking and then build a process we follow. Typically, these phases can be identified as diagnosis, guiding policy and action plans. Today we are going to focus on the diagnosis portion. How do we go about diagnosing a situation? </p>\n<h3>“When you become a leader your job is to define the problem. Not solve it”</h3>\n<p>One key</p>\n<p>We often find ourselves stuck trying to solve problems, whether it is in our personal lives or professional careers. Rarely do we stop to ask ourselves if we are solving the correct problem. Or if the “problem” we have to solve is even a real problem. Oftentimes, things we identify as problems are really symptoms of something else and when we “solve” the problem, we have only put a temporary band aid on it. How do we start defining the real problems in life?</p>\n<p>Asking questions is a crucial step that often gets overlooked. It takes time, we can feel annoying and sometimes we don’t want to appear stupid in front of superiors. But, asking questions is the fastest way to truly understand the problem you are facing. One tactic to employ is approaching every problem naively, that is, we act as if everyone else knows more about the problem than we do. This helps us to set aside our ego and can prevent us from jumping to a conclusion about solutions to the problem.</p>\n<ol>\n<li>Ask questions.</li>\n<li>Identify any related problems, they may be a sign of a larger overarching problem</li>\n<li></li>\n</ol>","frontmatter":{"title":"Step One: Identify the Problem","date":"August 21, 2019","description":"A lot of people spend time focused on fixing problems, which is great. But when you are implementing strategic thinking, the first thing you need to do is identify the actual problem."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/identify-the-problem/","previous":{"fields":{"slug":"/what-is-strategy/"},"frontmatter":{"title":"Alright, What Exactly is Strategic Thinking?"}},"next":null}}