{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"2eef38b1-df49-5f0a-b6de-ea2d329be622","excerpt":"We all have work situations where we have to lead up or manage up, that is, we have to provide someone higher up than us with insight on how to better…","html":"<p>We all have work situations where we have to lead up or manage up, that is, we have to provide someone higher up than us with insight on how to better accomplish the organizations mission. These conversations can be difficult and awkward. Being a junior employee, it is a tense situation when you have to tell a senior leader that they aren’t doing things optimally.</p>\n<p>One of the most difficult moments I have had in my career was this exact situation. In my role, I was responsible for completely overhauling how the organization did their business. We were moving to a more data driven way of prioritizing work and very few people in the organization really bought in and saw the value in doing things this new way. So there was a lot of resistance to the change.</p>\n<p>After studying the problem and mapping out the existing process, my team was able to identify areas where several functions were performing overlapping work. We built a more streamlined process that reduced a lot of wasted effort and aligned the organization with the strategic vision. After walking my boss through the new process, he told me I would have to get the rest of the organizations leaders on board with it. There I was, a junior manager having to tell senior managers and executives they aren’t doing things right. That meeting was a difficult one.</p>\n<p>How did I handle that meeting? I went in not focused on telling anyone how wrong they were. Instead I focused on the ways this new process would improve things for the organization. One particular function was notorious for always talking about how they didn’t have the manpower required to get all of their work done. This new process would eliminate a lot of their work, as another function was also doing the same work.</p>\n<p>When you have to handle similar situations, focus on how the changes will be positive for the other party. Identify where they are winning in the change and sell them on that. When they object with other questions, be prepared to admit that you don’t have all the answers but together you can find them. Work to be a unifying voice instead of a divisive one. It all comes down to winning friends.</p>","frontmatter":{"title":"Leading Up","date":"October 20, 2019","description":"Sometimes we have to have difficult conversations with people who are senior to us. Focusing on creating positive outcomes is the best way to handle these situations. Work to win friends and you won't need to battle anyone."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/leading-up/","previous":{"fields":{"slug":"/perseverance/"},"frontmatter":{"title":"Sticking to a Goal"}},"next":{"fields":{"slug":"/heart-led/"},"frontmatter":{"title":"Command and Control vs. Heart-led Leadership"}}}}