{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"fed31d2c-459a-54e5-82e4-9dd45173ccf4","excerpt":"For the longest time I’ve told myself I will start my own side hustle eventually. I would sit down, plan out what I wanted to do and get started. For a little…","html":"<p>For the longest time I’ve told myself I will start my own side hustle eventually. I would sit down, plan out what I wanted to do and get started. For a little while, I would be motivated to stick with it and make progress on it daily. Then something would happen. Someone would invite me to go do something. I wouldn’t be feeling well. And I would miss a day. Then it would be a few days. Eventually I would realize it had been a few months since I did anything with that project and whatever inspiration I had initially would be long gone.</p>\n<p>I am willing to bet most people reading this have some similar story. How can we fight this battle? There are a few strategies that I have found so far, none of them are perfect. There’s the old school, just force yourself to grind strategy. This is where you make yourself do whatever it is you need to do, for me this would be writing.  The downside to this strategy is that eventually, you may start viewing this side project as a negative thing in your life. It can become a weight that drags you down.</p>\n<p>Another strategy is looking at your side hustle and finding meaning or purpose within it. A lot of people pursue a side hustle to bring in some extra money, but also as an escape from a day job they may not enjoy. If you can align your side hustle with a sense of purpose in your life, that can overcome any lack of motivation. </p>\n<p>Finally, you can leverage those times when you are feeling motivated or inspired and use them to build a system that sets you up for success when you are lacking the motivation. If you are creating content as a side hustle, planning out the topics for your content in advance or building layouts of post ideas would be one possible system. Writing multiple posts on one day to build up a buffer for those days when life happens and you can’t sit down to take care of business. All sorts of little tricks. </p>\n<p>For me, this time around, I am combining strategies two and three to help keep me moving forward on this. I’ve challenged myself to get a post up each day in October. So far I have made it happen. When I have motivation and inspiration, I am writing down a list of topics I want to cover, building some skeletion posts that I can go fill in later when I don’t have anything else. And I have a topic that keeps me interested and pushing forward. Join me in the journey.</p>","frontmatter":{"title":"Are You Motivated or Dedicated?","date":"October 06, 2019","description":"We hear it all the time, it's easy to get stuff done when you're motivated but the true power comes when you are so dedicated, you get stuff done when you aren't motivated."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/motivation-or-dedication/","previous":{"fields":{"slug":"/building-effective-organizations/"},"frontmatter":{"title":"Building Effective Organizations"}},"next":{"fields":{"slug":"/why-leadership/"},"frontmatter":{"title":"Finding Our Purpose"}}}}