{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"30ef43fb-f48d-5cd1-8c4f-ef8e22524bc8","excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a series of podcasts…","html":"<br>\n<p><em>Earlier this year <a href=\"https://twitter.com/naval\">@naval</a> posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a series of podcasts expounding on each individual tweet (view it <a href=\"https://nav.al/how-to-get-rich#more-28492840\">here</a>). Each of these posts provided a more in depth look at what he meant. In this series of posts I will summarize what each podcast covers and write out some actionable take aways I plan on implementing from that particular conversation.</em></p>\n<p>This converstaion was very interesting to me. As someone who grew up in a blue collar family, there was almost this taboo about wanting to be rich. There was this belief that rich people stole their wealth from someone else. Looking at wealth as a fixed quantity, not as something that can be increased across all of humanity. Naval highlights how this is an incorrect view of the economy, that in fact the economy can continue increasing in size as people start adding newer things of value to the overall system.</p>\n<h3>Key Takeaways</h3>\n<p><strong>Wealth is not a zero sum game.</strong></p>\n<p><strong>True wealth creates abundance for the world.</strong></p>\n<p>When we look at building wealth as adding new things of value to the world, we no longer have to think about how we can “trick” someone out of their money. We can instead start looking for holes that need to be filled. Anytime we think, “there should be a different way to do this,” we should instantly start ideating on that. Trying to identify why it is frustrating to us and how we can reduce or remove that frustration.</p>\n<h3>Action Items</h3>\n<p>For me, I think the paragraph above really sums up what my action item is going to be from this particular tweet:</p>\n<p><strong>Look for pain points in life and try to solve them.</strong></p>","frontmatter":{"title":"Make Abundance for the World - My Thoughts","date":"June 16, 2019","description":"Do not confuse creating wealth with stealing from other people."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/create-abundance/","previous":{"fields":{"slug":"/seek-wealth/"},"frontmatter":{"title":"Seek Wealth, Not Money or Status - My Thoughts"}},"next":null}}