{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"e4e6f928-ae77-5a00-a935-fbad8aefeb47","excerpt":"This entry covers the converstaion around free markets and how they are intrinsic to humans. One of the things I have found to be incredible with Naval is how…","html":"<br>\n*Earlier this year [@naval](https://twitter.com/naval) posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a series of podcasts expounding on each individual tweet (view it [here](https://nav.al/how-to-get-rich#more-28492840)). Each of these posts provided a more in depth look at what he meant. In this series of posts I will summarize what each podcast covers and write out some actionable take aways I plan on implementing from that particular conversation.*\n<p>This entry covers the converstaion around free markets and how they are intrinsic to humans. One of the things I have found to be incredible with Naval is how he reframes ideas. This one in particular, I never thought about a conversation as being a value exchange. But he highlights how we as humans inherently track credits and debits, in the context of a conversation. If I am talking to you and feel like I am not getting enough value out of it, I will stop the conversation. He uses this as a parallel to how we operate in the free market. If you have a good or service I want, it will cost me some value to get that good or service. </p>\n<p>He also draws comparisons to organic systems, where there are parasites and symbiotes that come together to create a functioning system. Some organisms take nutrients and return a different form of that nutrient, while others just take and take and take. This part of the conversation shifted the focus to groups that despise wealth and want to redistribute it throughout society. They highlight what is happening in Venezuela as the epitome of a society that focused on redistributing wealth without incentivizing the creation of wealth.</p>\n<h3>Key Takeaways</h3>\n<p><strong>Humanity is the only species that keeps track of credits/debits.</strong>\n<strong>This inherent tracking is the same as free markets.</strong></p>\n<h3>Action Items</h3>\n<p>I think, for me, the biggest action item I have from this one is just going to be focusing on bringing equal value to every transaction I participate in.</p>","frontmatter":{"title":"Free Markets are Intrinsic to Humans -- My Thoughts","date":"June 18, 2019","description":"Human beings by nature keep track of credits and debits in all aspects of life. This is an inherent part of being human and works the same way as free markets do in economics."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/free-markets-are-intrinsic/","previous":{"fields":{"slug":"/create-abundance/"},"frontmatter":{"title":"Make Abundance for the World - My Thoughts"}},"next":null}}