{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"b3410f6e-b07f-55e3-9b8c-dc30b165ee51","excerpt":"Good strategy is built on an underlying structure that anyone can use in their own life. We can generalize three distinct phases in strategic thinking and then…","html":"<p>Good strategy is built on an underlying structure that anyone can use in their own life. We can generalize three distinct phases in strategic thinking and then build a process we follow. Typically, these phases can be identified as diagnosis, guiding policy and action plans. Today we are going to focus on the diagnosis portion. How do we go about diagnosing a situation? </p>\n<p>Clearly identifying our current position is the key motivator during diagnosis. In military strategy this is when the scouts are out finding the enemies locations, watching their movements and identifying key parts of the battlefield. In life, this would be the time spent assessing what your current situation is. What does your career look like? What do your relationships look like? What is the general direction you are headed? Asking yourself these and other similar questions will help you diagnose the current state of your battlefield.</p>\n<h2>What is a good tool to use during diagnosis?</h2>\n<p>Since diagnosis is all about gathering information and building out your “map of the territory”, the most effective and simplest tool available to us are questions. A lot of times, we avoid asking questions because we worry that we will appear incompetent. We worry people will question why we are in our position if we have to ask all these questions. In reality, we all have blind spots and asking questions is the easiest way to minimize our blind spots.</p>\n<h3>“When you become a leader your job is to define the problem. Not solve it”</h3>\n<p>Remember, during diagnosis the goal is to identify the current state of things. As we explore the current state, the possibility for emotional reactions to what we discover exists. We need to focus solely on gathering the information during this stage. Expanding our understanding will allow us to build a plan to move us closer to where we want to be. </p>","frontmatter":{"title":"Step One: Diagnosis","date":"August 21, 2019","description":"When we start to implement strategic thinking it can be easy to feel overwhelmed and unsure of where or how to begin. During these first few posts I am going to explore the essential components and strategy and strategic thinking."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/identify-the-problem/","previous":{"fields":{"slug":"/what-is-strategy/"},"frontmatter":{"title":"Alright, What Exactly is Strategic Thinking?"}},"next":null}}