{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"3710efbb-47f5-5f53-8df7-03fe782f4311","excerpt":"I was offered my first management job at 29 after 5 years of managing projects. I’ll be the first to admit, I wasn’t the greatest project manager but I was…","html":"<p>I was offered my first management job at 29 after 5 years of managing projects. I’ll be the first to admit, I wasn’t the greatest project manager but I was effective in getting work done. I knew how to effectively leverage all members of a team to ensure a project was successful. I thought I was ready to go be a kick ass manager and prove to other people they were wrong to doubt my abilities.</p>\n<p>I was totally unprepared for the shift in responsbilities, going from well defined and measurable daily/weekly/monthly goals I was responsible for meeting, to this more esoteric concept of managing resources assigned to me. The breadth of everything I was responsible for was incredibly overwhelming. I had no idea what I was doing.</p>\n<p>Two years later, I was recognized as the Davis-Monthan AFB Senior Civilian of the Year, an award given to the most impactful civilian on the installation for a given year. How did I manage to go from being an overwhelmed slacker to one of the top performers in my field? There were a lot of external factors that helped, from an incredibly supportive boss to the incredibly talented teams I was lucky to work with. But there was also a big internal shift within myself that helped me.</p>\n<p>Learning how to lead, learning how to build lasting relationships and learning to understand an organizations mission statement are all key skills I had to pick up. Throughout this journey, I gained a deeper understanding of my own inherent strengths and weaknesses and I am attempting to document some of these here. This is not an article about those, today I just wanted to highlight the power of betting on yourself.</p>","frontmatter":{"title":"Be Willing to Bet on Yourself","date":"October 03, 2019","description":"When presented with a new situation, fear can be useful"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/bet-on-yourself/","previous":{"fields":{"slug":"/wpengine-ceo-talk/"},"frontmatter":{"title":"A Conversation with Heather Brunner, WPEngine CEO"}},"next":null}}