{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"b4ebec7f-7c9b-53ce-a1f5-36d2fddcf58b","excerpt":"Howdy, y’all!So, June and July have been some hectic months. I moved to Texas, started a new job and have been slowly getting settled in and exploring my new…","html":"<h3>Howdy, y’all!</h3>\n<p>So, June and July have been some hectic months. I moved to Texas, started a new job and have been slowly getting settled in and exploring my new city. This has kind of put a damper on my energy and focus to write and put out new content. But, I am starting to feel more settled, so I plan on starting to make more time for writing and creating new content for the site.</p>\n<p>As part of this, I want to start highlighting some of the items I read each week that really open my eyes. You know, another generic weekly roundup type of blog post. However, I plan on including not only articles, but also books that I am reading and some background information on those books.</p>\n<p>I also plan on shifting the focus of the blog from the random software development/personal finance focus I have had to more of a critical thinking/decision analysis focus. I have been reading a lot in both of these areas lately and want to start writing things about them to help myself remember the topics, and if my writing benefits someone else out there then thats even better!</p>\n<p>Alright, enough catch up let’s talk about what I’ve been reading.</p>\n<h5>Blogs</h5>\n<ul>\n<li><a href=\"https://www.collaborativefund.com/blog/\">Collaborative Fund</a>:\nSo this first one isn’t a particular post, but the overall blog over at Collaborative Fund always has some really interesting articles. Mostly focused on finance, but theres some good gems about overall decision making included.</li>\n<li><a href=\"https://www.calculatedriskblog.com/\">Calculated Risk</a>:\nI actually found this blog from Collaborative Fund, but it has a lot of really interesting economic data commentary. Not quite focused on decision making, but any decision requires facts to help guide it and he provides some incredible fact based analysis.</li>\n</ul>","frontmatter":{"title":"A Brief Catch Up & Currently Reading","date":"July 30, 2019","description":"After a short hiatus, I figured it was time to provide a brief update as to what has been going on in life and provide a brief list of some of the best things I've been reading lately."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/currently-reading/","previous":{"fields":{"slug":"/making-money-isnt-luck/"},"frontmatter":{"title":"Making Money isn't About Luck -- My Thoughts"}},"next":null}}