{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"d2eb875d-7ae5-527a-a452-1f2c0cadc08f","excerpt":"Yesterday I wrote a little about how to keep making progress on a goal when we aren’t feeling motivated. One of the strategies I identified was finding a goal…","html":"<p>Yesterday I wrote a little about how to keep making progress on a goal when we aren’t feeling motivated. One of the strategies I identified was finding a goal that aligns with our purpose or meaning in life. For the longest time I couldn’t figure out what meaning or purpose I had. Today I wanted to share a little of my experience that helped me to understand and find a true purpose.</p>\n<p>I’ve always been an introspective person, looking back on life, reviewing what I’ve done and how I can be a better human. Doing this helps me to understand weaknesses I have as well as allows me to see connections that I missed when I was living through these experiences. When I do this, I tend to break my life up into a few distinct phases and look at what was going on during each phase. Recently I began noticing a common theme that popped up repeatedly during these phases of my life.</p>\n<h3>College Life</h3>\n<p>While I was in undergrad, I was searching for that traditional college experience. I wanted to get out, make new friends and go to parties. One day I got an email inviting me to an informational session about a new fraternity that was coming to camus and I checked it out. During the informational session, I found out this fraternity did not have a chapter on campus and I would be helping to build it from the ground up. If I joined, I would be on the ground floor shaping the organization from day one. I was hooked immediately. While we worked through the chartering process, it was not smooth sailing. We hit numerous roadblocks and had a lot of stalled progress. Eventually, I was handed ownership of the chartering process and was told to have the paperwork completed in six months. With a lot of help, I was able to meet the deadline.</p>\n<h3>Early Career</h3>\n<p>My first job out of undergrad was working as a project manager/project engineer in a government office. There were a lot of problems in this office, people who had worked together for years and allowed old grudges to fester. There were times I would overhear people shouting at each other on the phone. It was an unpleasant place to work. But, because I was new and didn’t have all of these previous experiences biasing my actions, I was able to get work done. People soon started turning to me to help interface between different offices. The acqusitions people would call me and ask me to help one of the engineers clarify his documents. Other project managers would ask me how to approach the acquisitions people without starting a fight.</p>\n<h3>Mid Career</h3>\n<p>After my time as a project manager, I accepted a position managing a small department at a new location. This role would be my first true leadership role but I would soon realize it wasn’t just going to be a simple management gig. When I showed up, the organization was going through a massive IT system upgrade that required changing a lot of old business processes. Further, they hadn’t completed the requirements of a previous reorganization effort, leaving them with a lot of duplicated work. I spent my first year simply trying to understand what, exactly, my department was supposed to be doing. After three years, I had managed to streamline a lot of our processes and align other departments with their intended purpose.</p>\n<h3>Finding the Common Theme</h3>\n<p>With hindsight, it’s easy to connect threads that run through our lives. We can build up an image of ourselves in the moment that doesn’t accurately reflect who we truly are. Throughout my life I have never seen myself as an exceptional leader. I tend to be more of a quiet person, focusing on the work I need to get done in my own life. After looking back through these different phases of my life, I realized that leadership is something I value and am good at. I want to start sharing lessons on leadership with more people, identifying how they can use it to improve their own lives.</p>","frontmatter":{"title":"Finding Our Purpose","date":"October 07, 2019","description":"Sometimes it takes a while for people to find their purpose. It took me years to connect the strings that have run through a lot of my life experiences. But the payoff is so worth it."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/why-leadership/","previous":{"fields":{"slug":"/motivation-or-dedication/"},"frontmatter":{"title":"Are You Motivated or Dedicated?"}},"next":{"fields":{"slug":"/measuring-outcomes/"},"frontmatter":{"title":"Effectiveness, Efficiency and Measuring Outcomes"}}}}