{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Random Thoughts on SuccessAfter this past week, I’ve been reflecting a little on what has driven my previous success. One of the key themes…","fields":{"slug":"/drive-success/"},"frontmatter":{"date":"September 29, 2019","title":"Driving Success","description":"Reflecting on my past successes, I have noticed a strong common theme. None of these successes or awards were earned from my own efforts, in every endeavor I have been successful there has been a strong team, built with strong relationships."}}},{"node":{"excerpt":"I am vehemently anti-meetings. When I ran my teams with the Air Force, I did my best to limit the intrusions on my team members time with…","fields":{"slug":"/blindsided/"},"frontmatter":{"date":"September 29, 2019","title":"Gathering Effectively","description":"How many organizations waste time with pointless meetings? Why don't we fight back against them, not by killing the meeting, but by taking more ownership of them?"}}},{"node":{"excerpt":"How do we build more effective teams in an organization?As a leader/manager in an organization, it is crucial to create highly effective…","fields":{"slug":"/effective-teams/"},"frontmatter":{"date":"September 28, 2019","title":"Building Effective Teams","description":"I was recently reminded that life revolves around the relationships we build with people. In work, it's easy to just say \"I am paying this person to do this function, so they need to do it.\" Yes, that can have results, but with that transactional nature you won't get anything more from that person."}}},{"node":{"excerpt":"So recently I was having a conversation with someone about work and career progression and they made a comment that got me thinking. They…","fields":{"slug":"/career-strategy/"},"frontmatter":{"date":"August 23, 2019","title":"Be Strategic in Your Career Choices","description":"As we progress in our careers, it is important to have an understanding of how each new job takes us closer, or farther, from our career goals. It's easy to just float along without thinking about where we are  headed. But this can lead us into positions that we are unhappy with or ones that don't align with our inner strengths."}}},{"node":{"excerpt":"Good strategy is built on an underlying structure that anyone can use in their own life. We can generalize three distinct phases in…","fields":{"slug":"/identify-the-problem/"},"frontmatter":{"date":"August 21, 2019","title":"Step One: Diagnosis","description":"When we start to implement strategic thinking it can be easy to feel overwhelmed and unsure of where or how to begin. During these first few posts I am going to explore the essential components and strategy and strategic thinking."}}},{"node":{"excerpt":"Strategy: a high level plan to achieve one or more goals under conditions of uncertaintity. —WikipediaIn life, we often set goals for…","fields":{"slug":"/what-is-strategy/"},"frontmatter":{"date":"August 18, 2019","title":"Alright, What Exactly is Strategic Thinking?","description":"Okay, Jordan, you announced you are going to focus your content on strategy and strategic thinking. Awesome. But what exactly is strategy? How do you turn that into strategic thinking? What does all of this mean to us?!"}}},{"node":{"excerpt":"For anyone who has been following me, you have seen the series I was doing on Naval Ravikants tweetstorm on how to create wealth. I got up…","fields":{"slug":"/strategy-project/"},"frontmatter":{"date":"August 17, 2019","title":"Strategy Project","description":"After flitting from topic to topic without any discernible direction, I have decided to focus my writing on strategy and strategic thinking/planning. It is a topic that has been important in my career and I think more people would benefit from learning about it."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/give-society-what-it-wants/"},"frontmatter":{"date":"August 13, 2019","title":"Give Society What It Doesn't Know How To Get -- My Thoughts","description":"When working to create wealth for ourselves and society, we need to seek out what unique product we can provide and then figure out how to scale it."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/live-below-your-means/"},"frontmatter":{"date":"August 11, 2019","title":"Live Below Your Means -- My Thoughts","description":"Living below your means grants you a certain freedom that people who live at or above their means never experience. When we live below our means, we are less likely to fall into the wage slave trap that afflicts a lot of society. We can pick and choose what we give our time and energy to."}}},{"node":{"excerpt":"I often find myself wanting to write. I’ll be at home, at work or out and about and thing to myself “I really want to just sit down and…","fields":{"slug":"/do-the-work/"},"frontmatter":{"date":"August 10, 2019","title":"Just Do The Work","description":"How often do we find ourselves putting off things we don't want to do? We'll spend hours, days even, avoiding things until we absolutely can't avoid it any longer. And then we do it. And it's not nearly as bad as we thought. We would all be better off just doing the work."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/renting-out-your-time/"},"frontmatter":{"date":"August 08, 2019","title":"You Won't Get Rich Renting Out Your Time -- My Thoughts","description":"Holidng a regular 9-5 job is essentially renting out your time. Someone offers you some money to show up at a certain place and you do it. When you rent out your time, you limit your output based on your input. You will never generate true wealth until your outputs can non-linearly scale from your inputs. Creating new products or businesses is the only way to generate non-linear outputs."}}},{"node":{"excerpt":"How do we make better decisions? What are the biggest hindrances people face when trying to make decisions? In regular life as well as…","fields":{"slug":"/radical-open-mind/"},"frontmatter":{"date":"August 06, 2019","title":"Making Better Decisions with a Radically Open Mind","description":"When we make decisions in life, we want to believe we are basing these decisions on things that are true. Any analysis we may run is worthless if the underlying information is flawed. One way to really assess the validity of our underlying information is through radical open mindedness."}}},{"node":{"excerpt":"Howdy, y’all!So, June and July have been some hectic months. I moved to Texas, started a new job and have been slowly getting settled in and…","fields":{"slug":"/currently-reading/"},"frontmatter":{"date":"July 30, 2019","title":"A Brief Catch Up & Currently Reading","description":"After a short hiatus, I figured it was time to provide a brief update as to what has been going on in life and provide a brief list of some of the best things I've been reading lately."}}},{"node":{"excerpt":"This conversation discusses the concept and role of luck required to become wealthy. There is a common misconception that wealthy people…","fields":{"slug":"/making-money-isnt-luck/"},"frontmatter":{"date":"June 20, 2019","title":"Making Money isn't About Luck -- My Thoughts","description":"There is a common misconception that rich people got \"lucky\" at some point in their life. But really, most wealthy people got there by being the type of person that makes money."}}},{"node":{"excerpt":"This entry covers the converstaion around free markets and how they are intrinsic to humans. One of the things I have found to be incredible…","fields":{"slug":"/free-markets-are-intrinsic/"},"frontmatter":{"date":"June 18, 2019","title":"Free Markets are Intrinsic to Humans -- My Thoughts","description":"Human beings by nature keep track of credits and debits in all aspects of life. This is an inherent part of being human and works the same way as free markets do in economics."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/create-abundance/"},"frontmatter":{"date":"June 16, 2019","title":"Make Abundance for the World - My Thoughts","description":"Do not confuse creating wealth with stealing from other people."}}},{"node":{"excerpt":"Earlier this year @naval posted a long tweetstorm about how to get rich without getting lucky, which blew up. Since then he has posted a…","fields":{"slug":"/seek-wealth/"},"frontmatter":{"date":"June 15, 2019","title":"Seek Wealth, Not Money or Status - My Thoughts","description":"Confusing money and status with wealth gives people the wrong incentives in their life."}}},{"node":{"excerpt":"Allow me to reintroduce myself…Since I’ve revamped my site, I figured it would be a good idea to provide a bit more detail on who I am and…","fields":{"slug":"/about-me-post/"},"frontmatter":{"date":"May 21, 2019","title":"Who is Jordan Ristow?","description":"Brief background about the author"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}