{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"751d5f48-7b2e-5fc9-a749-8faa54b1b7bd","excerpt":"How do we make better decisions? What are the biggest hindrances people face when trying to make decisions? In regular life as well as business, it is often…","html":"<p>How do we make better decisions? What are the biggest hindrances people face when trying to make decisions? In regular life as well as business, it is often viewed that whoever can make the fastest decision will win the situations. In reality, it is whoever makes the best decision quickly who often winds up winning. But what goes into making a better decision? Most companies don’t put time into training their people on how to make better decisions. Most people just go about it the best they can. Stumbling through life making the most optimal decisions they know how. But usually these decisions aren’t the true optimal decision. Our brains have a lot of subliminal ways to hide things we aren’t strong in to protect our ego. We are terrible at recognizing what our blind spots are and this leads us to overconfidence in predicting outcomes of our decisions.</p>\n<p><strong><em>“Well cool Jordan, thanks for completely destroying my fragile mental state already. Do you have any advice on how to get better at this?” -Anyone reading this, probably. Maybe.</em></strong></p>\n<p>Decision making is a very complex process. We take in information, analyze it, make predictions about trends we may see and then use all of that to come to some conclusion. A lot of discussion around decision making focuses on the analysis and prediction portions of this process. Every article out there talking about mental models is really focused on ways to analyze and predict. But what happens if the information supporting that analysis isn’t 100% accurate? How do we know we have good information to begin with? Any analysis or prediction based on faulty information is going to fail, no matter how good the techniques used to make it. How can we dial in on the truth when we seek out information? One promising place to start is with radical open-mindedness.</p>\n<p>Radical open-mindedness is a concept Ray Dalio explores a lot in his book Principles. Essentially, it boils down to opening ourselves up to being wrong. Welcoming disagreements as a pursuit of finding out what is true, instead of viewing them as fights to be won. Suspending our ego and accepting that we will not always have the correct answer and that is okay. Focusing on achieving our goal instead of looking good by always having the answer. Finally, reaching out to different experts and having them explain opposing viewpoints to you from their perspective.</p>\n<h3>Ego and Blind Spots: The Twin Pillars of Terrible Decision Making</h3>\n<p>Our biggest obstacle in drilling down into what is true, tends to be ourselves. I know, shocking. We’re all amazing thinkers and see things clearly all of the time. Not. Our brains are very good at protecting our ego. Ego, everyone has one but no one wants to admit it. It is that part of us that experiences and reacts to the outside world. It is the part of us that gets bruised when we find out we are wrong. What causes us to cling to ideas, even when we have seen they are incorrect. The ego prevents us from recognizing our blind spots, those areas where we don’t know as much as we think we know. These two combined, ego and blind spots, are our two greatest barriers to finding out what is true.</p>\n<p>One of my favorite quotes in this area comes from Ray Dalio. He says:</p>\n<p><strong><em>“Replace your attachment to being right with the joy of learning what’s true.”</em></strong></p>\n<p>I have found this to be a strong guiding light in my own quest for better decisions. Anytime we feel upset during a discussion, we should take a step back and recognize, it is probably stemming from our ego trying to protect us from being hurt. During these moments we need to fight to suspend our ego and accept that maybe you are actually wrong. A lot of times we get caught up in trying to look good, by having the correct answer, but if we don’t actually have the correct answer, we wind up looking bad. We need to shift our focus to simply achieving our goal, and accepting that maybe this time we don’t have the correct answer.</p>\n<p>I am still in the process of being radically open-minded, working to suspend my ego and approach situations assuming I am wrong. I am constantly battling old tendencies of assuming I am the smartest person at the table. But I am making progress on it. Share with me your progress on suspending your ego!</p>","frontmatter":{"title":"Making Better Decisions with a Radically Open Mind","date":"August 06, 2019","description":"When we make decisions in life, we want to believe we are basing these decisions on things that are true. Any analysis we may run is worthless if the underlying information is flawed. One way to really assess the validity of our underlying information is through radical open mindedness."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/radical-open-mind/","previous":{"fields":{"slug":"/currently-reading/"},"frontmatter":{"title":"A Brief Catch Up & Currently Reading"}},"next":{"fields":{"slug":"/renting-out-your-time/"},"frontmatter":{"title":"You Won't Get Rich Renting Out Your Time -- My Thoughts"}}}}