{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"6b149bc1-e7d0-5614-8839-f311407623c3","excerpt":"Over the first few years of my career, I learned about managing risk within a portfolio. For me, specifically, that risk came in the form of catastrophic…","html":"<p>Over the first few years of my career, I learned about managing risk within a portfolio. For me, specifically, that risk came in the form of catastrophic infrastructure failure. The air conditioning system in our server building going down, a concrete slab in the middle of the runway crumbling into pieces as planes take off and land or the electrical substation overloading causing an entire installation to be without power for an extended period of time. When this is the world you are immersed in, your brain starts to view things differently from people. I am constantly weighing the benefits of one action versus another action.</p>\n<h3>What does this mean for me, Jordan?</h3>\n<p>Thats a great question. Whether in your personal life or professional, weighing the risks you are taking is a critical aspect of thriving. Identifying the total overall risk across an entire portfolio allows us to make better informed decisions to guide our lives. I’m sure everyone has heard of the phrase, death by a thousand paper cuts. This is what can happen when total risk isn’t weighed when choosing to pursue some new initiative. Companies are littered with abandoned projects that seemed like a great idea at the time but quickly became resource drains.</p>\n<h3>Okay, but what portfolio are you talking about here?</h3>\n<p>Generally speaking, a portfolio can be considered any collection of things. Typically, in businesses, portfolios are made up of programs and projects. An example from my own life, my previous employer had an environmental portfolio which was composed of air quality and water quality management programs, as well as environmental restoration projects. In a personal life, the easiest example would be a personal finance portfolio, comprised of any income you earn, long term debt, short term debt and investments.</p>\n<h3>So, how do I apply risk management?</h3>\n<p>This can be a tricky question to answer, so I am going to do my best to simplify it down to a few basic concepts. First, never make a decision in isolation. I remember in my engineering classes we always got to work with isolated systems. It made the calculations easier but we never get to deal with isolated systems in the real world. There is always external forces applying pressures to any system. As a real life example of this, lets look at personal finances. It’s easy to look at isolated expenses and think they aren’t that bad, $10 for Netflix sounds cheap, so does $15 for HBONow and of course everyone needs to be more mindful so we need Headspace at $13. Oh and we have to have a SoulCycle membership. Pretty soon, we’ve created a $300 bill every month from all of these insignificant expenses.</p>\n<p>Second, identify what your priorities are and eliminate anything not tied to those priorities. For a real world example of this, my last job was to build out a comprehensive list of every facility or infrastructure requirement the installation had. Every. Single. One. It was a long list and there would never be enough resources to meet every requirement. But, we knew what our priorities were. So having this list allowed us to analyze our entire portfolio and align our resource allocation with the organizations priorities. Our main missin was to launch airplanes, so any requirement that enabled us to do that was at the top of our list. Anything not directly enabling that mission was pushed to the bottom. This is ruthless and it doesn’t make you any friends but it is necessary to ensure the survival of any organization.</p>\n<h3>Wrapping up</h3>\n<p>If you take anything away from this, I hope it is the following:</p>\n<ol>\n<li>Don’t make decisions in isolation.</li>\n<li>Clearly identify your priorities and align decisions with them.</li>\n</ol>","frontmatter":{"title":"Let's Talk About Risk, Baby","date":"October 01, 2019","description":"Every day we take risks in both our personal and professional lives. There is no way to avoid it, simply getting out of bed carries the risk of falling down. Any time a company decides to roll out a new product, there is risk involved. Too often we treat these as isolated cases of risk when in reality, everything is connected. How can we look at broader risk and make better decisions based on that?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/risky-business/","previous":{"fields":{"slug":"/effective-gathering/"},"frontmatter":{"title":"Gathering Effectively"}},"next":{"fields":{"slug":"/wpengine-ceo-talk/"},"frontmatter":{"title":"A Conversation with Heather Brunner, WPEngine CEO"}}}}