{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"24cf845a-80e2-518e-b583-8987117b73f3","excerpt":"For the month of October, I set a goal/challenge for myself. I’ve had several false starts with building a writing habit and to get over the hump I challenged…","html":"<p>For the month of October, I set a goal/challenge for myself. I’ve had several false starts with building a writing habit and to get over the hump I challenged myself to write one post each day during the month of October. I had a lot of inspiration to start the month and it was smooth sailing the first two weeks.</p>\n<p>Then this week hit and I ran into a speed bump. I would sit down in the morning and have no idea what to write about. I would stare at my computer screen totally blank, then eventually I would wander around the internet looking for some inspiration. Some days I found some, others I was still blank. I managed to post something each day this week, but I would almost guarantee it wasn’t very good. If you read it, I apologize.</p>\n<p>But I did manage to post. I still have a chance at meeting my goal for the month. Earlier this week I saw something from Gary Vaynerchuk where he was talking about quantity versus quality. Most people talk about focusing on quality instead of quantity but he takes the opposite approach. He pushes a quantity of content with the belief that quality will follow. If we only put out those thoughts that we feel are perfect, we won’t put much out. If we instead focus on just creating something every day, eventually we will hone our skillset to where quality happens.</p>\n<p>So I’m still pushing through this month. Putting words on the screen and letting people read them.</p>","frontmatter":{"title":"Sticking to a Goal","date":"October 19, 2019","description":"Sometimes we set ourselves a goal and feel like it will be easy to meet that goal. But eventually we run into a wall and lose steam on progressing towards that goal."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/perseverance/","previous":{"fields":{"slug":"/bias/"},"frontmatter":{"title":"Fighting Your Biases"}},"next":{"fields":{"slug":"/leading-up/"},"frontmatter":{"title":"Leading Up"}}}}