{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"351cb265-6144-5145-9fdf-23b7745ee779","excerpt":"We all have internal biases that influence how we view other people and situations. It’s human nature, our brains want to bend the picture in our heads in our…","html":"<p>We all have internal biases that influence how we view other people and situations. It’s human nature, our brains want to bend the picture in our heads in our own favor. In every situation, we are unconciously framing other peoples actions based on our own experiences.</p>\n<p>For me, one of the first lessons I had to learn when I was put in charge of some teams was how to handle these internal biases. When I first took over as the manager in Arizona, I was being introduced to all of the members of each team I was responsible for. Before I met some of them, I had been told stories of them. One person in particular, I had been told was stubborn and only answered to one person. The person telling me this was trying to help me out, but I let this get in my head before I had met the member of my team.</p>\n<p>When I did meet them, I already had a negative image of them from other people. I didn’t go in demanding respect or anything, but I still expected them to react a certain way. When they didn’t I was kind of shocked. I felt like our interaction was going to be more confrontational, but they handled everything professionally and were excited to have me leading their team.</p>\n<p>This is a very narrow example of bias, specifically tied to how other people’s comments impacted my view of a person I had never met. But we have similar situations throughout our lives where we are making quick judgments about people based on some trait we notice in them. If we want to be better leaders, we need to work hard to limit how often we allow bias to influence a decision we make. This isn’t an article about how to do that. For a good resource, I would check out Daniel Kahneman’s excellent book <em>Thinking Fast and Slow</em>.</p>","frontmatter":{"title":"Fighting Your Biases","date":"October 18, 2019","description":"Working to recognize when internal bias is influencing your behavior is an important skill to develop as you grow your leadership ability."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/bias/","previous":{"fields":{"slug":"/being-present/"},"frontmatter":{"title":"Being Present"}},"next":null}}