{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"b83ccaad-3bf9-5136-9206-37a271e93835","excerpt":"Last night I ventured out to my first networking event here in Austin. Normally I’m not one to enjoy these, like most other people, because everything feels so…","html":"<p>Last night I ventured out to my first networking event here in Austin. Normally I’m not one to enjoy these, like most other people, because everything feels so transactional. But this event, Meet ATX, sounded like it may be a little different. Instead of the normal meet people, have drinks, maybe exchange info and then go home, the organizers have set up guided conversations with some of Austins’ business leaders. Last night we heard from Heath Brunner, the CEO of WPEngine. Overall, I think the event was valuable and I plan on going back when they host more. </p>\n<h3>If you dont ask, the answer is always no.</h3>\n<p>I think the biggest takeaway I had from listening to Heather is the power of simply asking for what you want. As she was telling her story and answering questions, this theme kept popping up. She mentioned several times where she got a position simply because she had asked for more responsbility or asked to learn a new skill. The people she had talked to remembered her asking and brought opportunities to her. If no one knows what you want, how can you expect to get it?</p>\n<h3>It’s all about the relationships.</h3>\n<p>It was interesting to hear another common theme that continued to pop up throughout her talk: building good relationships. During her career, she had the opportunity to meet and build relationships with people who would continue to support her. The timing of hearing this was pretty powerful, since I have been reflecting on what helped me to be successful and realizing it was always key relationships. It is just a reminder that when you build authentic relationships, they can magnify your ability to be successful.</p>\n<h3>Karma is powerful.</h3>\n<p>This point was something that I have believed in for a while. Whether you call it karma or something else, the idea that if you put good out into the world, you will be repaid is incredibly powerful. Hearing someone who has had great success remind me of this was encouraging. It encouraged me to continue writing down what I have learned from my experiences and putting it out into the world.</p>\n<h3>5 Questions</h3>\n<p>One of the most powerful things I took away from Heather is actually a set of questions she said she asks herself continuously:</p>\n<ul>\n<li>Am I growing?</li>\n<li>Am I learning?</li>\n<li>Am I having fun?</li>\n<li>Does my manager have my back?</li>\n<li>Do I have a plan for the future?</li>\n</ul>\n<p>CEO 4 V’s\nVision\nValues\nVictory\nVulnerable</p>","frontmatter":{"title":"A Conversation with Heather Brunner, WPEngine CEO","date":"October 02, 2019","description":"Last night I had the opportunity to attend an event where WPEngine CEO Heather Brunner was speaking. She shared her own experience with growing a career in tech while also balancing a personal life, along with a handful of lessons she had learned on the way. Here are a few key takeaways I had from this talk."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/wpengine-ceo-talk/","previous":{"fields":{"slug":"/risky-business/"},"frontmatter":{"title":"Let's Talk About Risk, Baby"}},"next":null}}