{"data":{"site":{"siteMetadata":{"title":"Jordan Ristow","author":"Jordan Ristow"}},"markdownRemark":{"id":"37bb1539-cd96-5e15-b558-60bad2a8ac99","excerpt":"When I started out as a project manager, I was dumped in the deep end without much of a life preserver. I had no idea what I was doing and no real guidance on…","html":"<p>When I started out as a project manager, I was dumped in the deep end without much of a life preserver. I had no idea what I was doing and no real guidance on what I should be doing. Anytime I asked my boss a question, he would send me someone elses work and tell me to try to reproduce what they made, however tailor it to my project. Anyone else have a similar story?</p>\n<p>It took me a few years to truly understand exactly what I was writing when I would pull together a statement of work. Coming from an engineering background, my world was numbers and equations, not written descriptions of what work I wanted someone else to perform.</p>\n<p>In order to succeed in that role, I had to work on my ability to explain tough technical concepts to people who did not have the same background as me. This was incredibly difficult, when you understand something so well and you feel like you explained it clearly but the other person didn’t understand. It can get super frustrating.</p>\n<p>In order to become more effective at any area of life, not just leadership, you need to be able to communicate well. I spent a lot of time working strategies to more clearly communicate with others. To start, I never rush any response whether in verbal conversations or via email. It’s easy to quickly read a persons email or hear their statement and immediately want to respond with the first thing that comes to mind. But that is usually not the best response. Second, I try to make my first response a question. Usually, people do not provide their entire well thought out argument at first. Asking questions allows you to explore their side of the argument first. On the other side of the coin, I try to provide details if I am initiating a conversation, focusing on relevant background information that can provide context to what I am saying.</p>\n<p>If you take the time and put in some work to build more effective communication habits, you will be amazed how quickly they will pay off. You don’t have to employ the strategies I found, explore and see what works best for you. But they are here as a starting point.</p>","frontmatter":{"title":"Effective Communication","date":"October 14, 2019","description":"Being able to clearly and effectively communicate with people is a challenge that everyone faces. A lot can be left up to the receiver, especially with the proliferation of text based communication channels."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/communication/","previous":{"fields":{"slug":"/seek-blindspots/"},"frontmatter":{"title":"Getting A Little More Personal"}},"next":{"fields":{"slug":"/career-planning/"},"frontmatter":{"title":"Career Planning"}}}}